MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECM100/mcu.h
extern volatile __SQI1BDBASEADDRbits_t SQI1BDBASEADDRbits __asm__ ("SQI1BDBASEADDR") __attribute__((section("sfrs"), address(0xBF8E2040)));
#define SQI1BDSTAT SQI1BDSTAT
extern volatile uint32_t   SQI1BDSTAT __attribute__((section("sfrs"), address(0xBF8E2044)));
typedef struct {
  uint32_t BDCON:16;
  uint32_t DMAACTV:1;
  uint32_t DMASTART:1;
  uint32_t BDSTATE:4;
} __SQI1BDSTATbits_t;
extern volatile __SQI1BDSTATbits_t SQI1BDSTATbits __asm__ ("SQI1BDSTAT") __attribute__((section("sfrs"), address(0xBF8E2044)));
#define SQI1BDPOLLCON SQI1BDPOLLCON
extern volatile uint32_t   SQI1BDPOLLCON __attribute__((section("sfrs"), address(0xBF8E2048)));
typedef struct {
  uint32_t POLLCON:16;
} __SQI1BDPOLLCONbits_t;
extern volatile __SQI1BDPOLLCONbits_t SQI1BDPOLLCONbits __asm__ ("SQI1BDPOLLCON") __attribute__((section("sfrs"), address(0xBF8E2048)));
#define SQI1BDTXDSTAT SQI1BDTXDSTAT
extern volatile uint32_t   SQI1BDTXDSTAT __attribute__((section("sfrs"), address(0xBF8E204C)));
typedef struct {
  uint32_t TXCURBUFLEN:8;
  uint32_t :8;
  uint32_t TXBUFCNT:5;
  uint32_t :4;
  uint32_t TXSTATE:4;
} __SQI1BDTXDSTATbits_t;
extern volatile __SQI1BDTXDSTATbits_t SQI1BDTXDSTATbits __asm__ ("SQI1BDTXDSTAT") __attribute__((section("sfrs"), address(0xBF8E204C)));
#define SQI1BDRXDSTAT SQI1BDRXDSTAT
extern volatile uint32_t   SQI1BDRXDSTAT __attribute__((section("sfrs"), address(0xBF8E2050)));
typedef struct {
  uint32_t RXCURBUFLEN:8;
  uint32_t :8;
  uint32_t RXBUFCNT:5;
  uint32_t :4;
  uint32_t RXSTATE:4;
} __SQI1BDRXDSTATbits_t;
extern volatile __SQI1BDRXDSTATbits_t SQI1BDRXDSTATbits __asm__ ("SQI1BDRXDSTAT") __attribute__((section("sfrs"), address(0xBF8E2050)));
#define SQI1THR SQI1THR
extern volatile uint32_t   SQI1THR __attribute__((section("sfrs"), address(0xBF8E2054)));
typedef struct {
  uint32_t THRES:7;
} __SQI1THRbits_t;
extern volatile __SQI1THRbits_t SQI1THRbits __asm__ ("SQI1THR") __attribute__((section("sfrs"), address(0xBF8E2054)));
#define SQI1INTSEN SQI1INTSEN
extern volatile uint32_t   SQI1INTSEN __attribute__((section("sfrs"), address(0xBF8E2058)));
typedef struct {
  uint32_t TXEMPTYISE:1;
  uint32_t TXFULLISE:1;
  uint32_t TXTHRISE:1;
  uint32_t RXEMPTYISE:1;
  uint32_t RXFULLISE:1;
  uint32_t RXTHRISE:1;
  uint32_t CONFULLISE:1;
  uint32_t CONEMPTYISE:1;
  uint32_t CONTHRISE:1;
  uint32_t BDDONEISE:1;
  uint32_t PKTCOMPISE:1;
} __SQI1INTSENbits_t;
extern volatile __SQI1INTSENbits_t SQI1INTSENbits __asm__ ("SQI1INTSEN") __attribute__((section("sfrs"), address(0xBF8E2058)));
#define USBCSR0 USBCSR0
extern volatile uint32_t   USBCSR0 __attribute__((section("sfrs"), address(0xBF8E3000)));
typedef struct {
  uint32_t FUNC:7;
  uint32_t :1;
  uint32_t SUSPEN:1;
  uint32_t SUSPMODE:1;
  uint32_t RESUME:1;
  uint32_t RESET:1;
  uint32_t HSMODE:1;
  uint32_t HSEN:1;
  uint32_t SOFTCONN:1;
  uint32_t ISOUPD:1;
  uint32_t EP0IF:1;
  uint32_t EP1TXIF:1;
  uint32_t EP2TXIF:1;
  uint32_t EP3TXIF:1;
  uint32_t EP4TXIF:1;
  uint32_t EP5TXIF:1;
  uint32_t EP6TXIF:1;
  uint32_t EP7TXIF:1;
} __USBCSR0bits_t;
extern volatile __USBCSR0bits_t USBCSR0bits __asm__ ("USBCSR0") __attribute__((section("sfrs"), address(0xBF8E3000)));
#define USBCSR1 USBCSR1
extern volatile uint32_t   USBCSR1 __attribute__((section("sfrs"), address(0xBF8E3004)));
typedef struct {
  uint32_t :1;
  uint32_t EP1RXIF:1;
  uint32_t EP2RXIF:1;
  uint32_t EP3RXIF:1;
  uint32_t EP4RXIF:1;
  uint32_t EP5RXIF:1;
  uint32_t EP6RXIF:1;
  uint32_t EP7RXIF:1;
  uint32_t :8;
  uint32_t EP0IE:1;
  uint32_t EP1TXIE:1;
  uint32_t EP2TXIE:1;
  uint32_t EP3TXIE:1;
  uint32_t EP4TXIE:1;
  uint32_t EP5TXIE:1;
  uint32_t EP6TXIE:1;
  uint32_t EP7TXIE:1;
} __USBCSR1bits_t;
extern volatile __USBCSR1bits_t USBCSR1bits __asm__ ("USBCSR1") __attribute__((section("sfrs"), address(0xBF8E3004)));
#define USBCSR2 USBCSR2
extern volatile uint32_t   USBCSR2 __attribute__((section("sfrs"), address(0xBF8E3008)));
typedef struct {
  uint32_t :1;
  uint32_t EP1RXIE:1;
  uint32_t EP2RXIE:1;
  uint32_t EP3RXIE:1;
  uint32_t EP4RXIE:1;
  uint32_t EP5RXIE:1;
  uint32_t EP6RXIE:1;
  uint32_t EP7RXIE:1;
  uint32_t :8;
  uint32_t SUSPIF:1;
  uint32_t RESUMEIF:1;
  uint32_t RESETIF:1;
  uint32_t SOFIF:1;
  uint32_t CONNIF:1;
  uint32_t DISCONIF:1;
  uint32_t SESSRQIF:1;
  uint32_t VBUSERRIF:1;
  uint32_t SUSPIE:1;
  uint32_t RESUMEIE:1;
  uint32_t RESETIE:1;
  uint32_t SOFIE:1;
  uint32_t CONNIE:1;
  uint32_t DISCONIE:1;
  uint32_t SESSRQIE:1;
  uint32_t VBUSERRIE:1;
} __USBCSR2bits_t;
extern volatile __USBCSR2bits_t USBCSR2bits __asm__ ("USBCSR2") __attribute__((section("sfrs"), address(0xBF8E3008)));
#define USBCSR3 USBCSR3
extern volatile uint32_t   USBCSR3 __attribute__((section("sfrs"), address(0xBF8E300C)));
typedef struct {
  uint32_t RFRMNUM:11;
  uint32_t :5;
  uint32_t ENDPOINT:4;
  uint32_t :4;
  uint32_t NAK:1;
  uint32_t TESTJ:1;
  uint32_t TESTK:1;
  uint32_t PACKET:1;
  uint32_t FORCEHS:1;
  uint32_t FORCEFS:1;
  uint32_t FIFOACC:1;
  uint32_t FORCEHST:1;
} __USBCSR3bits_t;
extern volatile __USBCSR3bits_t USBCSR3bits __asm__ ("USBCSR3") __attribute__((section("sfrs"), address(0xBF8E300C)));
#define USBIENCSR1 USBIENCSR1
extern volatile uint32_t   USBIENCSR1 __attribute__((section("sfrs"), address(0xBF8E3014)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t OVERRUN:1;
    uint32_t DATAERR:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :5;
    uint32_t DISNYET:1;
    uint32_t :1;
    uint32_t ISO:1;
  };
} __USBIENCSR1bits_t;
extern volatile __USBIENCSR1bits_t USBIENCSR1bits __asm__ ("USBIENCSR1") __attribute__((section("sfrs"), address(0xBF8E3014)));
#define USBFIFO0 USBFIFO0
extern volatile uint32_t   USBFIFO0 __attribute__((section("sfrs"), address(0xBF8E3020)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO0bits_t;
extern volatile __USBFIFO0bits_t USBFIFO0bits __asm__ ("USBFIFO0") __attribute__((section("sfrs"), address(0xBF8E3020)));
#define USBFIFO1 USBFIFO1
extern volatile uint32_t   USBFIFO1 __attribute__((section("sfrs"), address(0xBF8E3024)));
typedef struct {
  uint32_t DATA:32;
} __USBFIFO1bits_t;
